/**
 * 恋爱日记配置
 */
export default {
	waveImageUrl: 'https://b.925i.cn/uni_halo/uni_halo_about_wave.gif', // 波浪图片地址
	bgImageUrl: 'https://b.925i.cn/uni_halo_love/love_bg1.png', // 背景图片
	loveImageUrl: 'https://b.925i.cn/uni_halo_love/like.png', // 爱心图片

	boy: {
		name: '未知男主',
		avatar: 'https://b.925i.cn/uni_halo_love/love_boy.png',
		birthday: '2022-09-25', // 生日
	},

	girl: {
		name: '未知女主',
		avatar: 'https://b.925i.cn/uni_halo_love/love_girl.png',
		birthday: '2022-04-19', // 生日
	},
	timeTitle: '这是我们一起走过的',
	loveStartDate: '2022-04-10 13:14:20', // 恋爱开始时间 

	nav: [{
			key: 'journey',
			use: true,
			iconImageUrl: 'https://b.925i.cn/uni_halo_love/diandian.png',
			title: '关于我们',
			desc: '我们一起度过的那些经历'
		},
		// {
		// 	key: 'album',
		// 	use: true,
		// 	iconImageUrl: 'https://b.925i.cn/uni_halo_love/diandian.png',
		// 	title: '恋爱相册',
		// 	desc: '定格了我们的那些小美好'
		// },
		{
			key: 'list',
			use: true,
			iconImageUrl: 'https://b.925i.cn/uni_halo_love/diandian.png',
			title: '恋爱清单',
			desc: '你我之间的约定我们都在努力实现'
		},
	],

	// 关于我们：支持富文本内容
	journey: `
		准备晚安啦,睡觉前讲个故事吧~<p>槐树庄的村口有一棵大槐树，树下的村口第一家就是猫奶奶的家。</p><p>猫奶奶是一位孤寡老人，因为她经常收留和救治周围的流浪猫，所以村民就都管她叫“猫奶奶”。</p><p>一个月圆之夜，猫奶奶走到院门口，忽然发现门口石级上放着一个红毯子，里面包着一个啼（tí）哭的女婴。</p><p>猫奶奶找不到女婴的父母，只好收留了她，并给她起了个名字叫樱红。</p><p>猫奶奶辛苦地抚育着樱红成长，转眼之间，樱红已经九岁，上小学三年级了。</p><p>从樱红懂事起，猫奶奶就爱给她讲一个睡前故事，那是当地一个古老的传说。</p><p>在浓郁的树影深处有一个百花园，百花园里生长着奇花异草，还住了一个会唱歌的花仙子。花仙子的歌声美丽动人，能治百病。但是那里有一条奇怪的规矩，寻找花仙子的人在进入百花园后，见到花仙子之前，都不能发出一点声音，不然花仙子就不会出来见他。</p><p>受这个故事的影响，樱红特别喜欢唱歌。</p><p>这天晚上，樱红放学回家，家家户户炊烟袅（niǎo）袅，而自家烟囱却连一丝一缕（lǚ）的炊烟都没有。</p><p>樱红一惊，冲进院门一看，果然出事了！只见猫奶奶呻吟着倒在灶台前，双目紧闭，两只小脚也在不停地抽搐（chù）。</p><p>樱红慌了，好在有邻居的帮助，猫奶奶被送到了医院。经过抢救，猫奶奶总算醒过来，但是却半身不遂（suí），说话也不利落了。</p><p>猫奶奶不能下地行走做家务，小小的樱红，一夜之间就挑起了家庭的重担。</p><p>樱红一面求助于村委会，四处寻医问药，让猫奶奶获得进一步的治疗；一面在课余学做家务，悉心照顾猫奶奶，端水喂饭，不辞辛苦。</p><p>自从猫奶奶病倒以后，樱红每天早晨推开院门就会看见门前放着一朵小花，有时还会有一两尾鲜活的鲑（guī）鱼。</p><p>这样过了三个月，好奇的樱红在一个夜晚悄悄躲在院门的后面，想看看到底是谁。</p><p>到了午夜十二点，只见一只花猫衔着一棵风铃草来到院门前，把风铃草放下，转身就走。（浪漫童话小故事）樱红认出这只小花猫曾经被猫奶奶救助过，于是，她悄悄地尾随小花猫往前走。</p><p>不一会儿，她就发现自己进入了一个从未见过的世界：蔚蓝的天空飘着七色的云，阳光千丝万缕地落下来，鲜花盛开，彩蝶飞舞，百鸟齐鸣。</p><p>这到底是什么地方？她忽然想起了那个传说，这该不会就是花仙子住的百花园吧？</p><p>樱红几乎惊叫起来，但她立即想起了那条在见到花仙子之前，不能发出一点声音的规矩。于是她捂紧了嘴巴。</p><p>这时，她发现百花园里除了自己还有一个面色苍白的男孩子，闭着眼睛，右手攥着一根竹竿摸索着前行，应该是眼睛看不见了。</p><p>只见男孩子慢慢地偏离了路径，马上就要掉进路边的水沟里了。</p><p>樱红下意识地大声呼喊：“站住，小心脚底下！”一张口，樱红才想起来，自己已经坏了规矩！</p><p>此时，“轰隆”一声巨响后，眼前的一切都消失了，樱红仍然站在自家院门前的大槐树下。</p><p>真遗憾啊！樱红深深叹了口气，可为了救人，她并不觉得后悔。</p><p>第二天早上，樱红被一种美妙的歌声唤醒。</p><p>唱歌的人就是美丽的花仙子，她乘坐着奇花异草编成的花篮，飘进了她家的院子里。</p><p>奇迹发生了，只见猫奶奶起身下床，像健康人一样走出房门。</p><p>猫奶奶看到了花仙子，不敢相信地揉着眼睛说：“你就是传说中的花仙子吗？是你治好了我的病？”</p><p>花仙子说：“是的！是这个小女孩的善良打动了我，连我那不能出声的规矩都要为她破例了。”</p><p>樱红高兴地看着猫奶奶。从此，她和猫奶奶继续幸福地生活着。</p>
	`,
	// 恋爱相册
	albumKeyName: '恋爱相册', // 对应后台的图库分组名称
	// 恋爱清单
	loveList: {
		useApi: false, // 是否启用api接口
		api: '', // api 接口（如果使用api接口的方式，则下方的data可以留空，但是api接口必须按照对应的数据格式返回）
		data: [{
				index: 0, // 序号
				finish: true, // 是否已完成
				title: '偷偷记录对方熟睡的模样', // 事件名称
				desc: '偷偷观察对方熟睡的模样，记录下来', // 事件描述
				detail: {
					start: '2022年05月20日', // 计划开始时间
					desc: '偷偷观察对方熟睡的模样，记录下来', // 事件详细描述
					end: '每天', // 完成时间，
					moment: '', // 完成瞬间的记录
					other: '', // 其他说明
				}
			}, {
				index: 1,
				finish: false,
				title: '陪对方过生日',
				desc: '陪对方一起过生日',
				detail: {
					start: '2023年05月20日',
					desc: '陪对方一起过生日，他和我的生日',
					end: '',
					moment: '',
					other: '他 生日5月20日 我生日9月25日',
				}
			},
			{
				index: 2,
				finish: false,
				title: '一起去旅行',
				desc: '一起来一场说走就走的旅行，希望去的是大理',
				detail: {
					start: '',
					desc: '',
					end: '',
					moment: '一起来一场说走就走的旅行，希望去的是大理',
					other: '',
				}
			},
			{
				index: 3,
				finish: false,
				title: '一起穿情侣装逛街',
				desc: '一起穿情侣装逛街',
				detail: {
					start: '',
					desc: '',
					end: '',
					moment: '',
					other: '',
				}
			},
			{
				index: 4,
				finish: false,
				title: '一起看日出',
				desc: '一起看日出',
				detail: {
					start: '',
					desc: '',
					end: '',
					moment: '',
					other: '',
				}
			},
			{
				index: 5,
				finish: false,
				title: '一起看日落',
				desc: '一起看日落',
				detail: {
					start: '',
					desc: '',
					end: '',
					moment: '',
					other: '', // 其他说明
				}
			},
			{
				index: 6,
				finish: false,
				title: '一起买菜、做饭、刷碗',
				desc: '一起买菜、做饭、刷碗',
				detail: {
					start: '',
					desc: '',
					end: '',
					moment: '',
					other: '',
				}
			}
		],
	}
}